package codingtestReview;

public class SKT_0909 {
    //1번
    // 배열 주어지고 해당 배열에 다트 던지면 점수 획득
    //빙고일 경우 10점 추가, 중복 점수 인정 안함
    //최종 점수값 반환

    //2번
    //이메일 발송시간 문제
    //서버에서 전송실패, 전송지연 오류 발생함
    //메세지가 서버에서 처리되는동안 전송 실패면 메세지 삭제(-1), 전송 지연되면 처리시간 *2
    // 최종 도착시간 [5,-1,10,-1,29]이런식으로 반환

    //3번
    //페이지 앞으로가기,뒤로가기,이동하기 문제
    //반복횟수만큼 해당 연산을 수행한다.(최대 10^9)
    //10^9이라 그냥 하나씩 deque 에 넣어주면 안되고 [start,end] 이렇게 처리해야함
    // 나중에 10^9인거 알게되었고 처리 및 구현이 제법 까다로웠다.

    //4번
    //전선 연결하기
    //배열주어지고 각 부품쌍들 주어지면 전선 안겹치게 모든 부품 전선으로 연결
    //그후 전선 배열 return
    //dfs+backtracking 문제인데 완탐을 할 수 있을까 고민하다가 3번으로 넘어갔다.
    //시간 좀 더 있으면 해볼만할거 같았다.

}
